## 중복색인

In [1]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

enter = lambda :print('==============',end='\n\n')
def f_print(x):
    print("[함수] >> ",x)
    print(eval(x))
    enter()

print('''
인덱스가 꼭 유니크할 필요는 없다''')
obj = Series(range(5), index=['a','a','b','b','c'])
f_print("obj")
print('''
중복되는 색인 값이 있을 경우에는 색인을 이용한 결과로 Series 객체를 반환한다.''')
f_print("obj['a']")
print('''
중복되는 색인 값이 없을 경우에는 색인을 이용한 결과로 스칼라 값을 반환한다.''')
f_print("obj['c']")

인덱스가 꼭 유니크할 필요는 없다
[함수] >>  obj
a    0
a    1
b    2
b    3
c    4
dtype: int64
==============


중복되는 색인 값이 있을 경우에는 색인을 이용한 결과로 Series 객체를 반환한다.
[함수] >>  obj['a']
a    0
a    1
dtype: int64
==============


중복되는 색인 값이 없을 경우에는 색인을 이용한 결과로 스칼라 값을 반환한다.
[함수] >>  obj['c']
4
==============

In [2]:
df = DataFrame(np.random.randn(4,3), index=['a','a','b','b'])
f_print("df")
f_print("df.loc['b']")

[함수] >>  df
          0         1         2
a -0.825745 -1.218195 -0.129264
a -0.553958  1.152098  1.361581
b -0.318052  0.059632 -1.554564
b  0.171870  1.153998  0.835938
==============

[함수] >>  df.loc['b']
          0         1         2
b -0.318052  0.059632 -1.554564
b  0.171870  1.153998  0.835938
==============

## 기술 통계 계산  
- Pandas는 일반적인 수학/통계 메소드를 가지고 있다.
- Pandas의 메소드는 처음부터 누락된 데이터를 제외하도록 설계되어 있다.

In [3]:
df = DataFrame([
    [1.4,np.nan],
    [7.1,-4.5],
    [np.nan,np.nan],
    [0.75,-1.3]
],index=['a','b','c','d'],
columns=['one','two'])
print(df)
enter()
print('''sum()메소드는 각 컬럼의 합을 더해서 Series객체를 반환한다.
NaN은 기본적으로 제외된다.''')
f_print("df.sum()")
print('''행 기준으로 더하려면 axis 옵션 추가
전체 구간의 값이 NA가 아니라면 NA값은 제외시키고 계산을 하는데
skipna 옵션은 정체 행이나 칼럼의 값이 NA가 아니더라도 제외시키지 않을 수 있다.''')
f_print("df.sum(axis=1)")
f_print("df.sum(axis=1,skipna=False)")

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3
==============

sum()메소드는 각 컬럼의 합을 더해서 Series객체를 반환한다.
NaN은 기본적으로 제외된다.
[함수] >>  df.sum()
one    9.25
two   -5.80
dtype: float64
==============

행 기준으로 더하려면 axis 옵션 추가
전체 구간의 값이 NA가 아니라면 NA값은 제외시키고 계산을 하는데
skipna 옵션은 정체 행이나 칼럼의 값이 NA가 아니더라도 제외시키지 않을 수 있다.
[함수] >>  df.sum(axis=1)
a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64
==============

[함수] >>  df.sum(axis=1,skipna=False)
a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64
==============

In [4]:
print('''idxmin, idxmax와 같은 메소드는 최소,최대값을 가지고 있는 색인 값 같은 
간접 통계를 반환한다.
''')
f_print("df")
f_print("df.idxmin()")
f_print("df.min()")

idxmin, idxmax와 같은 메소드는 최소,최대값을 가지고 있는 색인 값 같은
간접 통계를 반환한다.

[함수] >>  df
    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3
==============

[함수] >>  df.idxmin()
one    d
two    b
dtype: object
==============

[함수] >>  df.min()
one    0.75
two   -4.50
dtype: float64
==============

## 누산 메소드  
: cumsum() 계속해서 더하는 함수

In [5]:
f_print("df")
f_print("df.cumsum()")

[함수] >>  df
    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3
==============

[함수] >>  df.cumsum()
    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8
==============

### 유일한 값, 도수 메서드

In [6]:
s1 = Series(['c','a','d','a','a','b','b','c','c'])
f_print("s1")
print('''unique 메소드 : 중복된 값을 하나로 표기''')
f_print("s1.unique()")
print('''.value_counts() : 값의 갯수를 출력(도수), 결과값은 Series(내림차순)''')
f_print("s1.value_counts()")
print('''isin : 어떤 값이 Series에 있는지 나타내는 메소드
불린값을 반환한다.
DataFrame, Series에서 원하는 값을 골라내고 싶을 때 유용하게 사용하는 메소드''')
f_print("s1.isin(['a'])")

mask = s1.isin(['b','c'])
s1[mask]

[함수] >>  s1
0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object
==============

unique 메소드 : 중복된 값을 하나로 표기
[함수] >>  s1.unique()
['c' 'a' 'd' 'b']
==============

.value_counts() : 값의 갯수를 출력(도수), 결과값은 Series(내림차순)
[함수] >>  s1.value_counts()
c    3
a    3
b    2
d    1
dtype: int64
==============

isin : 어떤 값이 Series에 있는지 나타내는 메소드
불린값을 반환한다.
DataFrame, Series에서 원하는 값을 골라내고 싶을 때 유용하게 사용하는 메소드
[함수] >>  s1.isin(['a'])
0    False
1     True
2    False
3     True
4     True
5    False
6    False
7    False
8    False
dtype: bool
==============

0    c
5    b
6    b
7    c
8    c
dtype: object

In [7]:
data = DataFrame({'Q1':[1,3,4,3,4],
                'Q2':[2,3,1,2,3,],
                 'Q3':[1,5,2,4,4]})
print(data)
enter()
print('''DataFrame에서는 apply를 이용하여 메소드를 넘김''')
f_print("data.apply(pd.value_counts)")
f_print("data.apply(pd.value_counts).fillna(0)")

   Q1  Q2  Q3
0   1   2   1
1   3   3   5
2   4   1   2
3   3   2   4
4   4   3   4
==============

DataFrame에서는 apply를 이용하여 메소드를 넘김
[함수] >>  data.apply(pd.value_counts)
    Q1   Q2   Q3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0
==============

[함수] >>  data.apply(pd.value_counts).fillna(0)
    Q1   Q2   Q3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0
==============

### 누락된 데이터 처리  
- Pandas의 설계 목표 중 하나는 누락된 데이터를 쉽게 처리하는것  
- Pandas에서는 누락된 데이터를 실수든 아니든 모두 NaN으로 취급한다.
- 이러한 Nan의 값은 파이썬의 None값 NA와 같은 값으로 취급된다.

In [8]:
stringData = Series(['aaa','bbb',np.nan,'ccc'])
print(stringData)

0    aaa
1    bbb
2    NaN
3    ccc
dtype: object

In [9]:
stringData.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [10]:
stringData[0] = None
print(stringData)
enter()
print(stringData.isnull())

0    None
1     bbb
2     NaN
3     ccc
dtype: object
==============

0     True
1    False
2     True
3    False
dtype: bool

## 누락된 데이터 골라내기  
- dropna 함수를 이용하는 방법 등 여러 방법이 있을 수 있다.
* dropna를 사용하는 것이 유용한 방법이며, 사용 결과값으로 Series 객체를 반환

In [11]:
import pandas as pd
import numpy as np
from numpy import nan as NA
from pandas import Series,DataFrame

data = Series([1,NA,3,4,NA,8])
print(data)
enter()
f_print("data.dropna()")

0    1.0
1    NaN
2    3.0
3    4.0
4    NaN
5    8.0
dtype: float64
==============

[함수] >>  data.dropna()
0    1.0
2    3.0
3    4.0
5    8.0
dtype: float64
==============

## 불린 색인을 이용해서 직접 계산한 후에 가져오기

In [12]:
f_print("data.notnull()")
f_print("data[data.notnull()]")
f_print("data[~data.isnull()]")

[함수] >>  data.notnull()
0     True
1    False
2     True
3     True
4    False
5     True
dtype: bool
==============

[함수] >>  data[data.notnull()]
0    1.0
2    3.0
3    4.0
5    8.0
dtype: float64
==============

[함수] >>  data[~data.isnull()]
0    1.0
2    3.0
3    4.0
5    8.0
dtype: float64
==============

- DataFrame에서 누락된 데이터를 골라 내기
- dropna는 기본적으로 NA값이 하나라도 있는 로우는 제외시킨다.

In [13]:
data = DataFrame([
    [1,5.5,3],
    [1,NA,NA],
    [NA,NA,NA],
    [NA,3.3,3]
])
print(data)
enter()
f_print("data.dropna()")
print('''option how = "all"옵션을 주면 모든값이 NA인 행만 제거된다.''')
f_print("data.dropna(how='all')")
#f_print("data.isnull()")
data[4]=NA
enter()
print(data)
f_print("data.dropna(how='all',axis=1)")

     0    1    2
0  1.0  5.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  3.3  3.0
==============

[함수] >>  data.dropna()
     0    1    2
0  1.0  5.5  3.0
==============

option how = "all"옵션을 주면 모든값이 NA인 행만 제거된다.
[함수] >>  data.dropna(how='all')
     0    1    2
0  1.0  5.5  3.0
1  1.0  NaN  NaN
3  NaN  3.3  3.0
==============

==============

     0    1    2   4
0  1.0  5.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  3.3  3.0 NaN
[함수] >>  data.dropna(how='all',axis=1)
     0    1    2
0  1.0  5.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  3.3  3.0
==============

In [14]:
data2 = DataFrame([
    [1,2,3,NA],
    [NA,33,11,NA],
    [11,NA,NA,NA],
    [43,NA,NA,NA]
])
print(data2)
print('''
몇개 이상의 value가 들어 있는 행을 가져오고 싶을 경우 사용되는 인자: thresh''')
enter()
f_print("data2.dropna(thresh=2)")
print('''
누락된 값을 채우기
데이터 프레임에서는 누락된 데이터를 완벽하게 골라낼 수가 없으므로 다른데이터도 함께 버려지게 된다.
이런 경우에는 fillna메서드를 활용해서 비어있는값(구멍)을 채워주면 데이터의 손실을 막을 수 있다.''')
f_print("data2.fillna(0)")
print('''\
fillna의 활용에 따라 각 칼럼마다 다른 값을 채워 넣을 수 있다.
-> fillna 값을 딕셔너리로 채워주면됨''')
f_print("data2.fillna({1:10,3:30})")
f_print("data2.fillna(method='ffill')")
f_print("data2.fillna(method='ffill',limit=1)")

      0     1     2   3
0   1.0   2.0   3.0 NaN
1   NaN  33.0  11.0 NaN
2  11.0   NaN   NaN NaN
3  43.0   NaN   NaN NaN

몇개 이상의 value가 들어 있는 행을 가져오고 싶을 경우 사용되는 인자: thresh
==============

[함수] >>  data2.dropna(thresh=2)
     0     1     2   3
0  1.0   2.0   3.0 NaN
1  NaN  33.0  11.0 NaN
==============


누락된 값을 채우기
데이터 프레임에서는 누락된 데이터를 완벽하게 골라낼 수가 없으므로 다른데이터도 함께 버려지게 된다.
이런 경우에는 fillna메서드를 활용해서 비어있는값(구멍)을 채워주면 데이터의 손실을 막을 수 있다.
[함수] >>  data2.fillna(0)
      0     1     2    3
0   1.0   2.0   3.0  0.0
1   0.0  33.0  11.0  0.0
2  11.0   0.0   0.0  0.0
3  43.0   0.0   0.0  0.0
==============

fillna의 활용에 따라 각 칼럼마다 다른 값을 채워 넣을 수 있다.
-> fillna 값을 딕셔너리로 채워주면됨
[함수] >>  data2.fillna({1:10,3:30})
      0     1     2     3
0   1.0   2.0   3.0  30.0
1   NaN  33.0  11.0  30.0
2  11.0  10.0   NaN  30.0
3  43.0  10.0   NaN  30.0
==============

[함수] >>  data2.fillna(method='ffill')
      0     1     2   3
0   1.0   2.0   3.0 NaN
1   1.0  33.0  11.0 NaN
2  11.0  33.0  11.0 NaN
3  43.0  33.0  11.0 NaN
==============

[함수] >>  data2.fillna(method='ffill',limit=1)
      0     1     2   3
0   1.0   2.0   3.0 NaN
1   1.0  33.0  11.0 NaN
2  11.0  33.0  11.0 NaN
3  43.0   NaN   NaN NaN
==============

In [15]:
#빈값을 평균값으로 채우기
data3 = Series([1,NA,3.5,NA,7])
data3.fillna(data3.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 다중 색인 (multi index)  
- 색인의 계층 : pandas의 중요 기능 중의 하나로 다중 색인 단계를 지정할 수 있다.

In [16]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

data = Series(np.random.randn(10),\
              index = [['a','a','a','b','b','b','c','c','d','d'],
                      [1,2,3,1,2,5,1,2,1,2]])
print('''색인이 계층적으로 이루어짐''')
f_print("data")
f_print("data.index,data.index[0]")
print('''계층구조에서 데이터 접근''')
f_print("data['b']")
f_print("data['a':'b']")
f_print("data[['a','d']]")

색인이 계층적으로 이루어짐
[함수] >>  data
a  1    0.068649
   2    1.129037
   3   -0.057422
b  1    0.063363
   2    0.122785
   5    0.351769
c  1   -2.226693
   2    0.598585
d  1   -0.699320
   2    0.070972
dtype: float64
==============

[함수] >>  data.index,data.index[0]
(MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3, 5]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 3, 0, 1, 0, 1]]), ('a', 1))
==============

계층구조에서 데이터 접근
[함수] >>  data['b']
1    0.063363
2    0.122785
5    0.351769
dtype: float64
==============

[함수] >>  data['a':'b']
a  1    0.068649
   2    1.129037
   3   -0.057422
b  1    0.063363
   2    0.122785
   5    0.351769
dtype: float64
==============

[함수] >>  data[['a','d']]
a  1    0.068649
   2    1.129037
   3   -0.057422
d  1   -0.699320
   2    0.070972
dtype: float64
==============

In [17]:
print(data)
enter()
print('''상위계층아래의 특정 인덱스 가져오기?''')
f_print("data[:,2],data[:,5]")

a  1    0.068649
   2    1.129037
   3   -0.057422
b  1    0.063363
   2    0.122785
   5    0.351769
c  1   -2.226693
   2    0.598585
d  1   -0.699320
   2    0.070972
dtype: float64
==============

상위계층아래의 특정 인덱스 가져오기?
[함수] >>  data[:,2],data[:,5]
(a    1.129037
b    0.122785
c    0.598585
d    0.070972
dtype: float64, b    0.351769
dtype: float64)
==============

In [18]:
df = DataFrame(np.arange(12).reshape(4,3),
              index = [
                  ['a','a','b','b'],
                  [1,2,1,2,]
              ],
              columns = [
                  ['seoul','busan','kwangju'],
                  ['red','green','blue']
              ])
print(df)
print('''>> 데이터 프레임에서도 다중 색인가능''')
enter()

    seoul busan kwangju
      red green    blue
a 1     0     1       2
  2     3     4       5
b 1     6     7       8
  2     9    10      11
>> 데이터 프레임에서도 다중 색인가능
==============

In [19]:
print('''컬럼 색인의 이름 정하기''')
df.columns.names = ['city','color']
print(df)
enter()
print('''인덱스의 이름도 지정''')
df.index.names = ['text','num']
print(df)

컬럼 색인의 이름 정하기
city  seoul busan kwangju
color   red green    blue
a 1       0     1       2
  2       3     4       5
b 1       6     7       8
  2       9    10      11
==============

인덱스의 이름도 지정
city     seoul busan kwangju
color      red green    blue
text num
a    1       0     1       2
     2       3     4       5
b    1       6     7       8
     2       9    10      11

In [20]:
f_print("df['seoul']")

[함수] >>  df['seoul']
color     red
text num
a    1      0
     2      3
b    1      6
     2      9
==============

## 색인계층의 순서 바꾸기  
- .swaplevel() 메소드를 이용해서 바꾼다.

In [21]:
df.swaplevel('text','num')

city     seoul busan kwangju
color      red green    blue
num text
1   a        0     1       2
2   a        3     4       5
1   b        6     7       8
2   b        9    10      11

In [22]:
#계층 바뀐김에 정렬도 해주는게 보기 좋음
# 사전식으로 계층을 바꾸어서 정렬하기 .sortlevel 메소드를 이용

df.swaplevel('text','num').sortlevel(0) #인자는 바꿀 레벨

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  after removing the cwd from sys.path.

city     seoul busan kwangju
color      red green    blue
num text
1   a        0     1       2
    b        6     7       8
2   a        3     4       5
    b        9    10      11

In [23]:
df.swaplevel('text','num').sort_index(0)

city     seoul busan kwangju
color      red green    blue
num text
1   a        0     1       2
    b        6     7       8
2   a        3     4       5
    b        9    10      11

## 계층을 이용한 통계해석

In [24]:
print(df)

f_print("df.sum(level='text')")
f_print("df.sum(level='num')")

print('''
각 색인별로 함수를 적용할 수 있음''')

city     seoul busan kwangju
color      red green    blue
text num
a    1       0     1       2
     2       3     4       5
b    1       6     7       8
     2       9    10      11
[함수] >>  df.sum(level='text')
city  seoul busan kwangju
color   red green    blue
text
a         3     5       7
b        15    17      19
==============

[함수] >>  df.sum(level='num')
city  seoul busan kwangju
color   red green    blue
num
1         6     8      10
2        12    14      16
==============


각 색인별로 함수를 적용할 수 있음

In [25]:
df = DataFrame(np.arange(12).reshape(4,3),
              index = [
                  ['a','a','b','b'],
                  [1,2,1,2,]
              ],
              columns = [
                  ['seoul','busan','kwangju'],
                  ['red','green','red']
              ])
print(df)
enter()
df.sum(level=1,axis=1)

    seoul busan kwangju
      red green     red
a 1     0     1       2
  2     3     4       5
b 1     6     7       8
  2     9    10      11
==============

     red  green
a 1    2      1
  2    8      4
b 1   14      7
  2   20     10

In [26]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

df = DataFrame({
    'a':range(7),
    'b':range(7,0,-1),
    'c':['one','one','one','two','two','two','two'],
    'd':[0,1,2,0,1,2,3]
})

df

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

**set_index 메서드** : 하나 이상의 칼럼을 색인으로 하는 새로운 DataFrame을 생성

In [27]:
df.set_index(['d','c',])
df.set_index(['c','d'])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

drop 옵션을 줘서 데이터 안날리고 인덱스 지정할수 있음

In [28]:
df.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

## set_index와 반대되는 개념의 메서드  
- reset_index : 인덱스를 다시 데이터로!

In [29]:
a = df.set_index(['c','d'])
a.reset_index(['c','d'])

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [30]:
a.reset_index(['c','d'],drop=True)

   a  b
0  0  7
1  1  6
2  2  5
3  3  4
4  4  3
5  5  2
6  6  1